#+TAGS: CLOCKIN(k) SUDO(s) CLIPBOARD(c) TRUNCATE(e)
#+SEQ_TODO: TODO TEST DONE
** For troubled network auto save frequently
#+BEGIN_SRC elisp
(setq auto-save-interval 1
          auto-save-timeout 1)
#+END_SRC

#+RESULTS:
: 1

* Haskell
#+BEGIN_SRC haskell
   increasing :: (Ord a) => [a] -> Bool
   increasing [] =  True
   increasing [x] = True
   increasing (x:y:ys) = x <= y && increasing(y:ys)
   increasing [5]
#+END_SRC

#+RESULTS:
: Prelude Data.List System.IO System.Process>
: <interactive>:250:1: Not in scope: ‘increasing’
* Wrap
#+NAME: wrap
#+BEGIN_SRC elisp :var snippet="" :var process="" :var file="" :var post=post_cmd[0](process,file)
  (with-temp-buffer
    (insert "#+NAME: ")
    (insert snippet)
    (insert "\n")
    (insert "#+BEGIN_SRC python :session :noweb yes")
    (insert post)
    (insert "\n")
    (insert "\"\"\"\n<<")
    (insert snippet)
    (insert ">>\n\"\"\"\n")
    (insert "#+END_SRC")
    (buffer-string))
#+END_SRC

#+BEGIN_SRC elisp :var snippet="abc" :var process="txt" :var file="abc.txt" :var post=post_cmd[0] :restuls output
  (with-temp-buffer
    (cond  ((eq process  "aync")
              (concat snippet "_" "aync")
              (concat post ":post cmdaync(*this*)"))
             ((eq process  "fwrite" )
              (concat snippet "_" "aync")
              (concat ":post fwrite("  "\"" file "\"" "," "*this*"))
             (t (concat snippet "_" "txt")))
    (insert snippet)
    (insert "\n")
    (insert post)(buffer-string))
#+END_SRC

#+RESULTS:
: abc


#+NAME: wrap
#+BEGIN_SRC js :var snippet="abc" :var process="txt" :var file="del" :var post=""  :results raw
  var gen_post = function () {
      if (process === "aync") {
          return ":post " + "cmdaync" +  "(" + "*this*" + ")";
      }
      if (process === "fwrite"){
          return ":post " + "fwrite" + "(" + '"' +  file + '"' + "," + "*this*" + ")";
      }
      return post;
  };
  var code = "#+NAME: " + snippet + "_" + process + "\n";
  code = code + "#+BEGIN_SRC python :session :noweb yes "  + gen_post() + "\n";
  code = code + '"""<<' + snippet + '>>"""' + "\n";
  code = code + "#+END_SRC";
  console.log(code);
  return 0;
#+END_SRC

#+RESULTS: wrap
#+NAME: abc_txt
#+BEGIN_SRC python :session :noweb yes
"""<<abc>>"""
#+END_SRC


#+BEGIN_SRC elisp :var a="add" :var b="aync" :noweb yes
  (with-temp-buffer
    (insert <<post_cmd[0]("A","aync")>>)
    (buffer-string)
    )
    (insert "#+BEGIN_SRC python :session :noweb yes")

#+END_SRC

#+RESULTS:
:
: undefined hello

call_post_cmd("A","aync")



** Clujure
#+BEGIN_SRC js :cmd "babel-node"
  var digit_name = (function (n) {
      var names;
      return function (n) {
          if (!names){
              names = ['zero', 'one', 'two', 'three','four', 'five','six' ];
          }
          return names[n];
      };
  }());
  console.log(digit_name(6));
#+END_SRC

#+RESULTS:
: six
: undefined

** split words
#+NAME: splitw
#+BEGIN_SRC js :cmd "babel-node" :var a="Test123***  TEST"
    return a.split(" ").reduce(function (max, val) {
        console.log(max + "  " + val);
        return val.length > max ? val.length : max;
    } , 0);
#+END_SRC

#+RESULTS: splitw
: 0  Test123***
: 10
: 10  TEST
: 10

** multidimen arrary
#+BEGIN_SRC js :cmd "babel-node" :results output
  function largestOfFour(arr) {
    var p=[];
    arr.reduce(function(arrmax, arr1){
        var maxnumberofthearray = arr1.reduce(function(elmmax, elm) {
            return elm > elmmax ? elm: elmmax;
        },0);
        p.push(maxnumberofthearray);
        return 0;
    } , 0);
    return p;
  }

  console.log(largestOfFour([[4, 5, 1, 3], [13, 27, 18, 26], [32, 35, 37, 39], [1000, 1001, 857, 1]]));
#+END_SRC

#+RESULTS:
: [ 5, 27, 39, 1001 ]

*** MAP
#+BEGIN_SRC js :cmd "babel-node" :results output
  var contacts = [
      {
          "firstName": "Akira",
          "lastName": "Laine",
          "number": "0543236543",
          "likes": ["Pizza", "Coding", "Brownie Points"]
      },
      {
          "firstName": "Harry",
          "lastName": "Potter",
          "number": "0994372684",
          "likes": ["Hogwarts", "Magic", "Hagrid"]
      },
      {
          "firstName": "Sherlock",
          "lastName": "Holmes",
          "number": "0487345643",
          "likes": ["Intriguing Cases", "Violin"]
      },
      {
          "firstName": "Kristian",
          "lastName": "Vos",
          "number": "unknown",
          "likes": ["Javascript", "Gaming", "Foxes"]
      }
  ];


  function lookUp(firstName, prop){
  // Only change code below this line
    var directory = contacts.filter(function(address){
      if ( (prop in  address) && address["firstName"] === firstName ){
        return true;
      }
      return false;
    });
    return !directory.length ? "No such contact" : directory[0][prop];

  // Only change code above this line
  }

  // Change these values to test your function
  console.log(lookUp("Akira", "likes"));

#+END_SRC

#+RESULTS:
: [ 'Pizza', 'Coding', 'Brownie Points' ]

** char to string
#+BEGIN_SRC js :cmd "babel-node" :results output
  var a = "URYYB".split("").map(function(p){
      return /\s/.test(p) ? p: String.fromCharCode((p.charCodeAt(0)-65 +13)%26 +65);
  });
  console.log( "" + a);
#+END_SRC

#+RESULTS:
: H,E,L,L,O

** string Matching case
#+BEGIN_SRC js :cmd "babel-node" :results output
  function mutation(arr) {
    return arr[1].toLowerCase().split("").filter(function(m){
      return arr[0].toLowerCase().split("").indexOf(m) >= 0;
    }).length === arr[1].length;
/*
.reduce(function(a,b){
      if (a){
        return b >= 0? true: false;
      }
      return false;
    });
*/
  }
  console.log("|" + mutation(["hello", "Hello"]) + "|");
#+END_SRC

#+RESULTS:
: |true|

** Function Argument convert to array
#+BEGIN_SRC js :cmd "babel-node" :resutls output
  function destroyer(arr) {
    // Remove all the values
      var args = Array.prototype.slice.call(arguments, 1);
    return arr.filter(function(v){
        return !args.reduce(function(isthere,val){
            if (isthere === true) return true;
            return  (val === v) ? true : false;
      },false);
    });
  }

console.log(destroyer([1, 2, 3, 1, 2, 3], 2, 3));
#+END_SRC

#+RESULTS:
| 1 | 1 |

** sort
#+BEGIN_SRC js :cmd "babel-node" :resutls output
  function where(arr, num) {
    // Find my place in this sorted array.
    return arr.sort(function(a,b){
      return a > b;
    }).reduce(function(a,pos,index) {
        if ( pos < num )
            return a+1;
        return a;
    },0);
  }
  console.log(where([40, 60], 50));
#+END_SRC

#+RESULTS:
: 1
: undefined
** Sum min to max

#+BEGIN_SRC js :cmd "babel-node" :resutls output
  function sumAll(arr) {
    return [Math.min(arr[0],arr[1]), Math.max(arr[0],arr[1])].reduce(function(sum,b){
        return (b*(b+1))/2 - sum;
    },Math.min(arr[0],arr[1]));
  }

  console.log(sumAll([1, 4]));
#+END_SRC

#+RESULTS:
: 10
: undefined

** diffs

#+BEGIN_SRC js :cmd "babel-node" :resutls  output
  function diff(arr1, arr2) {
      var arr = arr1;
      // Same, same; but different.

      return arr2.filter( function (val) {
          var flag=true;
          arr = arr.reduce(function(diffs,elm){
              if(elm === val){
                  flag = false;
                  return diffs;
              }
              return diffs.concat(elm);
          },[]);
          return flag;
      }).concat(arr);
  }

return  diff(["andesite", "grass", "dirt", "pink wool", "dead shrub"], ["diorite", "andesite", "grass", "dirt", "dead shrub"]);

#+END_SRC

#+RESULTS:
| diorite | pink wool |

** Roman Numerial
#+NAME: ruman
#+BEGIN_SRC js :cmd "babel-node" :var num="353"
  var rumannumberrule = function(x,index){
      var rumancombination = [["I","V"],["X","L"],["C","D"]];
      if (x < 4) return rumancombination[index][0].repeat(x);
      if (x === 4) return rumancombination[index].join("");
      if (x < 9 ) return rumancombination[index][1] +  rumancombination[index][0].repeat(x-5);
      return rumancombination[index][0] + rumancombination[index+1][0];
  };

  var numtoarray = function(nm, numarr){
      if (nm === 0) return numarr;
      numarr.unshift(nm%10);
      return numtoarray(Math.floor(nm/10),numarr);
  };

  return numtoarray(num,[]).map(function(val, index,arrl) {
      return rumannumberrule(val,arrl.length - index -1);
  }).join("");
#+END_SRC

#+RESULTS: ruman
: CCCLIII

#+call: ruman(19)

#+RESULTS:
: XIX


#+BEGIN_SRC js :cmd "babel-node" :var r="I"
  var numtoarray = function(nm, numarr){
      if (nm === 0) return numarr;
      numarr.push(nm%10);
      return numtoarray(Math.floor(nm/10),numarr);
  };
  return numtoarray(322, []);
#+END_SRC

#+RESULTS:
| 2 | 2 | 3 |

** Reduce Data to Manipulate
#+BEGIN_SRC sh
npm install -g fs
#+END_SRC

#+RESULTS:
| /usr/local/lib |          |
| └──            | fs@0.0.2 |
|                |          |

#+BEGIN_SRC js :cmd "babel-node"
  let fs = require('fs');
  let output = fs.readFileSync('data.org','utf8')
                 .trim()
                 .split('\n')
                 .map( line => line.split('|').map( word => word.trim() )
                                              .filter(word => word.length))
                 .reduce((customers , line) => {
                     customers[line[0]] = customers[line[0]] || []
                     customers[line[0]].push({
                         name: line[1],
                         price: line[2],
                         quantity: line[3]
                     })
                     return customers
                  }, {})

  console.log('output', JSON.stringify(output, null, 2));
#+END_SRC

#+RESULTS:
#+begin_example
output {
  "mark Johnson": [
    {
      "name": "waffle",
      "price": "iron",
      "quantity": "80"
    },
    {
      "name": "blender",
      "price": "200",
      "quantity": "1"
    },
    {
      "name": "knife",
      "price": "10",
      "quantity": "4"
    }
  ],
  "Nikita Smith": [
    {
      "name": "waffle",
      "price": "iron",
      "quantity": "80"
    },
    {
      "name": "knife",
      "price": "10",
      "quantity": "2"
    },
    {
      "name": "nuts",
      "price": "20",
      "quantity": "3"
    }
  ]
}
undefined
#+end_example
*** Unclassifed
#+BEGIN_SRC js :cmd "babel-node" :resutls output
let re = /\w+\s/g;
let str = "fee fi fo fum";
let myArr = str.match(re);
//console.log( myArr);
console.log(/[a-z]+/.test(str[2]))
#+END_SRC

#+RESULTS:
: true
: undefined

#+BEGIN_SRC js :cmd "babel-node" :resutls output
var myArray = /d(b+)d/g.exec("cdbbbdsbz");
console.log(myArray.index);
#+END_SRC

#+RESULTS:
: 1
: undefined

#+BEGIN_SRC js :cmd "babel-node" :resutls output
  var myRe = new RegExp("\\w+\\s*","g");
  var myArray = "I go    to   school everyday".match(myRe);
  console.log(myArray);
#+END_SRC

#+RESULTS:
| I | go | to | school | everyday |

#+BEGIN_SRC js :cmd "babel-node" :resutls output
let re = /(\w+)\s(\w+)/;
let str = "John Smith";
let newStr = str.replace(re ,"$2, $1");
console.log(newStr);
#+END_SRC

#+RESULTS:
: Smith, John
: undefined

** crypto
#+BEGIN_SRC js :cmd "babel-node" :resutls output
  function translate(str) {
    var suffix="yay";
    var remainder ="";
    var vowelisthere = false;
    return str.split("").map(function(elm,index){
      var vowel={
        "a": true,
        "e": true,
        "i": true,
        "o": true,
        "u": true
      };
      console.log("|" + vowel[elm] + "|" + elm + "|" );
      if (vowel.hasOwnProperty(elm) && vowel[elm] === true){
          vowelisthere = true;
      }
      if (vowelisthere === false){
          remainder = remainder + elm;
          suffix= "ay";
          return "";
      }
      if (index === str.length -1){
        return elm + remainder + suffix;
      }
      return elm;
    }).join("");
  }

  console.log(translate("consonant"));

#+END_SRC

#+RESULTS:
#+begin_example
|undefined|c|
|true|o|
|undefined|n|
|undefined|s|
|true|o|
|undefined|n|
|true|a|
|undefined|n|
|undefined|t|
onsonantcay
undefined
#+end_example

** missing letter
#+BEGIN_SRC js :cmd "babel-node"  :resutls output
  function fearNotLetter(str) {
    var miss = undefined;
    str.split("").reduce(function(missing,b){
        if (b.charCodeAt(0) !== missing && miss === undefined) {
          console.log("|"+b+"|"+missing +"|" + b.charCodeAt(0) + "|");
          miss=String.fromCharCode(missing);
        }
        return missing+1;
    }, str[0].charCodeAt(0));
    return miss;
  }
fearNotLetter("abcdefghjklmno")

#+END_SRC

#+RESULTS:
: |j|105|106|
: undefined

#+BEGIN_SRC js :cmd "babel-node"
return "A".charCodeAt(0)
#+END_SRC

#+RESULTS:
: 65

** Sorted Union
#+BEGIN_SRC js :cmd "babel-node"
      function diff(arr1, arr2) {
          var arr = arr2;
          // Same, same; but different.

          return arr1.filter( function (val) {
              var flag=true;
              arr = arr.reduce(function(diffs,elm){
                  if(elm === val){
                      flag = false;
                      return diffs;
                  }
                  if (typeof elm === "number")
                      return diffs.concat(elm);
                  return diffs.concat([elm])
              },[]);
              return true;
          }).concat(arr);
      }

    function unite(arr1, arr2, arr3) {
        var args = Array.prototype.slice.call(arguments);
        return args.reduce(function(flat,arr){
            return diff(flat,arr);
        }, []);
    }
  //  return unite([1, 2, 3], [5, 2, 1]);
  return unite([1, 2, 3], [5, 2, 1, 4], [2, 1], [6, 7, 8])

#+END_SRC

#+RESULTS:
| 1 | 2 | 3 | 5 | 4 | 6 | 7 | 8 |
** html sytex change
#+BEGIN_SRC js :cmd "babel-node" :restuls output
    function convert(str) {
      // &colon;&rpar;
        var htmlized = (function() {
            var htmlmap = {
                "&": "&amp;",
                "<": "&lt;",
                ">": "&gt;",
                "\"":  "&quot;",
                "'": "&apos;",
            };
            return function(value) {
                return htmlmap[value];
            }
        }());
      var matched = str.match(/([&<>"'])/g);
      return !matched ? str : matched.reduce(function(st,elm){
          return st.replace(elm, htmlized(elm));
      },str);

    }

var r=convert("abc & bcd");
console.log(r);
#+END_SRC

#+RESULTS:
: abc &amp; bcd
: undefined

#+BEGIN_SRC js :cmd "babel-node" :resutls output
function convert(str){
  return str;
}
var r=convert("Dolce Gabbana Hello");
console.log(r);
#+END_SRC

#+RESULTS:
: Dolce Gabbana Hello
: undefined

** Object
#+BEGIN_SRC js :cmd "babel-node" :resutls output
  function hello(){
      var ar=[3,33,[333]];
      var f = function(arrr) {
          return arrr[2];
      }
      return f(ar).concat(3);
  }
  return hello();
#+END_SRC

#+RESULTS:
| 333 | 3 |

